# RoofExceedsMaxHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..RoofExceedsMaxHeight Property
BuiltInFailures..::..RoofFailures Class See Also
---
Roof exceeds user-specified maximum height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoofExceedsMaxHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofExceedsMaxHeight As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoofExceedsMaxHeight {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace